In [1]:
word = 'Layla'
sent = 'Layla is Cute'

In [2]:
word[0]

'L'

In [3]:
sent[0]

'L'

In [4]:
sent[0:5]

'Layla'

In [5]:
sent[0:len(sent)]

'Layla is Cute'

In [6]:
text = 'The Layla is cute, because she was cute'

In [7]:
print(text[:])

The Layla is cute, because she was cute

In [8]:
sent[-7:-3]

'is C'

In [10]:
sent[-3:]

'ute'

In [11]:
word[:3]

'Lay'

In [12]:
sent[4:]

'a is Cute'

In [13]:
sent[:]

'Layla is Cute'

In [14]:
sent[::2]

'Lyai ue'

In [15]:
a = 'Name : Layla'
b = 'Student ID : 20231111'
c = 'Hobby : Study'
d = 'Comment : Cute'

In [16]:
" ".join([a, b, c, d])

'Name : Layla Student ID : 20231111 Hobby : Study Comment : Cute'

In [17]:
strs = """Guard: What? Ridden en a horse?
Queen Raiden: Yes!
Guard: You're using coconute[n]s!
Queen Raiden: What?
Guard: You've Got ...Coconutes[s] you're banagins em together
"""

In [18]:
strs.splitlines()[::2]

['Guard: What? Ridden en a horse?',
 "Guard: You're using coconute[n]s!",
 "Guard: You've Got ...Coconutes[s] you're banagins em together"]

In [19]:
str(strs.splitlines()[::2]).replace('Guard','Yae Miko')

'[\'Yae Miko: What? Ridden en a horse?\', "Yae Miko: You\'re using coconute[n]s!", "Yae Miko: You\'ve Got ...Coconutes[s] you\'re banagins em together"]'

In [20]:
'{} is cute!'.format('Layla')

'Layla is cute!'

In [21]:
"""{0}은 매우매우 착하고 귀엽고 사랑스럽습니다.
이 사악한 {1}은 {0}을 괴롭히는 원인 중 하나입니다.""".format("레일라","나히다")

'레일라은 매우매우 착하고 귀엽고 사랑스럽습니다.\n이 사악한 나히다은 레일라을 괴롭히는 원인 중 하나입니다.'

In [22]:
"나히다는 {age}살 이상이다.".format(age = 500)

'나히다는 500살 이상이다.'

In [23]:
'나는 {:,} 원이 통장에 있으면 좋겠다'.format(99999999999999999999999999999999999)

'나는 99,999,999,999,999,999,999,999,999,999,999,999 원이 통장에 있으면 좋겠다'

In [26]:
'{0:.3}나는 기억한다. 1, {0:.3%}'.format(7/67890)

'0.000103나는 기억한다. 1, 0.010%'

In [27]:
'My id Code is {0:06d}'.format(12)

'My id Code is 000012'

In [28]:
'My love number is %d' % 10

'My love number is 10'

In [30]:
'%(name)s is very cute, but her sleep time is %(time).2f' % {'name' : 'Layla', 'time' : 1.1631212}

'Layla is very cute, but her sleep time is 1.16'

In [31]:
name = ['레일라', '12', '19']
f'{name[0]}! {name[1]} / {name[2]} 생일 축하해!'

'레일라! 12 / 19 생일 축하해!'

In [32]:
import re

In [34]:
ax = re.match(pattern='\d{10}', string='1234567890')

In [35]:
ax

In [36]:
"match" if bool(ax) else "Un match"

'match'

In [37]:
ax.start()

0

In [38]:
ax.end()

10

In [39]:
ax.span()

(0, 10)

In [40]:
ax.group()

'1234567890'

In [41]:
re.match(pattern='\d{3}\s\d{4}\s\d{4}', string = '123 4567 8901')

In [42]:
re.match(pattern='\(\d{3}\)\s\d{3}\-\d{4}', string = '(123) 456-7890')

In [43]:
re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string = '+1 (123) 456-7890')

In [45]:
p = re.compile('\D{9}\:\d{4}')
p.match('Localhost:8888')

In [47]:
my_exp = lambda x : x ** 2
my_exp_c = lambda x, n : x ** n

In [48]:
import pandas as pd

In [49]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})

In [50]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [51]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [53]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [54]:
df.apply(my_exp_c, n = 10)

                 a                  b
0      10000000000     10240000000000
1   10240000000000    590490000000000
2  590490000000000  10485760000000000

In [55]:
df['a'].apply(my_exp_c, n = 10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [56]:
df['a'] ** 10

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [57]:
printme = lambda x : print(x)

In [58]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [59]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [60]:
df.apply(printme, axis = 1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [61]:
def get_mean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [63]:
import numpy as np

In [62]:
df.apply(get_mean)

a    20.0
b    30.0
dtype: float64

In [64]:
df.apply(np.mean)

a    20.0
b    30.0
dtype: float64

In [65]:
df.apply(get_mean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [66]:
df.apply(np.mean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [67]:
import seaborn as sns

In [72]:
df = sns.load_dataset("titanic")

In [73]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [70]:
getNAN = lambda x : pd.isnull(x).sum()

In [74]:
df.apply(getNAN)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [83]:
getNAN2 = lambda x : (pd.isnull(x).sum()) / len(x)

In [84]:
df.apply(getNAN2)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [81]:
getNAN2 = lambda x : (pd.isnull(x).sum()) / x.size

In [82]:
df.apply(getNAN2)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [87]:
getnan2 = lambda x : ((pd.isnull(x).sum() / len(x))) * 100

In [88]:
df.apply(getnan2)

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [89]:
nonnan = lambda x : (1-(pd.isnull(x).sum() / len(x)))

In [90]:
df.apply(nonnan)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [91]:
nonnan = lambda x : (1-(pd.isnull(x).sum() / len(x))) * 100

In [92]:
df.apply(nonnan)

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
dtype: float64

In [93]:
df.apply(nonnan, axis = 1)

0       93.333333
1      100.000000
2       93.333333
3      100.000000
4       93.333333
          ...
886     93.333333
887    100.000000
888     86.666667
889    100.000000
890     93.333333
Length: 891, dtype: float64

In [96]:
df['missing'] = df.apply(lambda x : pd.isnull(x).sum(), axis = 1)

In [97]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2

In [99]:
df[df['missing'] >= 2].sample(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
545,0,1,male,64.0,0,0,26.000,S,First,man,True,NaN,Southampton,no,True,2
850,0,3,male,4.0,4,2,31.275,S,Third,child,False,NaN,Southampton,no,False,2
237,1,2,female,8.0,0,2,26.250,S,Second,child,False,NaN,Southampton,yes,False,2
428,0,3,male,NaN,0,0,7.750,Q,Third,man,True,NaN,Queenstown,no,True,3
637,0,2,male,31.0,1,1,26.250,S,Second,man,True,NaN,Southampton,no,False,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
283,1,3,male,19.0,0,0,8.050,S,Third,man,True,NaN,Southampton,yes,True,2
542,0,3,female,11.0,4,2,31.275,S,Third,child,False,NaN,Southampton,no,False,2
560,0,3,male,NaN,0,0,7.750,Q,Third,man,True,NaN,Queenstown,no,True,3
528,0,3,male,39.0,0,0,7.925,S,Third,man,True,NaN,Southampton,no,True,2
271,1,3,male,25.0,0,0,0.000,S,Third,man,True,NaN,Southampton,yes,True,2

In [100]:
df = pd.read_csv('../data/country_timeseries.csv', parse_dates=[0])

In [101]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [103]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')

In [104]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [105]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)